<?php

namespace Database\Seeders;

use App\Models\Setting;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SettingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Setting::firstOrCreate([
            'id' => 1,
        ], [
            'whatsapp' => '+966502687520',
            'donation_link' => 'https://tahfedsawir.sa/',
            'about' => '*مصحف إلكتروني*

حسنات تبقى لآيات تُتلى، حرفها حسنة، وحسنتها بعشرة في تجارة مع الله لن تكسد أبداً.

ساهم الآن بمصحفاً إلكترونياً بإسمك أو والديك ومن تحب، ويمكنك نشره على حساباتك ومشاركته لأصدقائك حتى يتلون، ولحسناتك يزيدون.

✿ *بمساهمتك تدعم مشاريع الجمعية ، وتجني الأجور* :_


🔸المساهمة في تعليم أكثر من 800 طالب وطالبة.


*المصحف الإلكتروني يحتوي على*

🔸 القرآن الكريم " مكتوب"

🔸 القرآن الكريم " مسموع"

🔸 القرآن الكريم بالتفسير

🔸 الأذكار

🔸 المسبحة الإلكترونية

🔸 أسماء الله الحسنى.',
            'about_waqf_male' => "اللهم تقبل من '{name}' هذا المصحف واجعله صدقة جارية عنه واجعله له نورًا وهدى ورحمة، اللهم اشرح صدره ويسر أمره واجعل أجر من يقرؤه يُصَب في موازين حسناته وارزقه حلاوة تلاوته آناء الليل وأطراف النهار، اللهم يامن توزعت الأرزاق بكرمه أمطر عليه بركتك وبلغه أسمى مراتب الدنيا وأعلى منازل الآخرة اللهم أرزقه إجابة الدعاء وصلاح الحال والأهل والمال اللهم انفعه به ومن تحب وارفعهم به ومن تحب واجعله لهم حجة إلى يوم القيامة يارب العالمين.",
            'about_waqf_female' => "اللهم تقبل من '{name}' هذا المصحف واجعله صدقة جارية عنها واجعله لها نورًا وهدى ورحمة، اللهم اشرح صدرها ويسر أمرها واجعل أجر من يقرؤه يُصَب في موازين حسناتها وارزقه حلاوة تلاوته آناء الليل وأطراف النهار، اللهم يامن توزعت الأرزاق بكرمه أمطر عليه بركتك وبلغه أسمى مراتب الدنيا وأعلى منازل الآخرة اللهم أرزقها إجابة الدعاء وصلاح الحال والأهل والمال اللهم انفعها به ومن تحب وارفعهم به ومن تحب واجعله لهم حجة إلى يوم القيامة يارب العالمين.",
        ]);
    }
}
